In [1]:
    from sqlalchemy import create_engine
    import pandas as pd
    import os
    
    from math import ceil
    from functools import reduce

In [2]:
    en=create_engine('postgresql://aaron:123@localhost/ny')

/home/aaron/miniconda/envs/mineria/lib/python3.6/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [3]:
en.connect()

In [4]:
#%%time
#lst_arch = [x for x in os.listdir('Datos/') if x[-3:]=='csv']

CPU times: user 590 µs, sys: 119 µs, total: 709 µs
Wall time: 705 µs

In [5]:
#%%time
#for arch in lst_arch:
 #       print("%s ..."%arch)
  #      df = pd.read_csv(os.path.join('Datos/',arch),
   #                      encoding='latin1',sep=',')
    #    df.columns = [x.lower() for x in df.columns]
     #   df.to_sql(con=en,index=False,chunksize=100000,
      #            if_exists='replace',
       #           name=arch.replace('.csv','').lower())

nyc-rolling-sales.csv ...
CPU times: user 38.4 s, sys: 4.92 s, total: 43.3 s
Wall time: 1min 22s

In [4]:
df = pd.read_sql(con=en,sql="nyc-rolling-sales")
df.head()

,unnamed: 0,borough,neighborhood,building-class-category,tax_class_at_present,block,lot,ease-ment,building_class_at_present,address,...,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,4,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,,C2,153 AVENUE B,...,5,0,5,1633,6440,1900,2,C2,6625000,2017-07-19 00:00:00
1,5,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,26,,C7,234 EAST 4TH STREET,...,28,3,31,4616,18690,1900,2,C7,-,2016-12-14 00:00:00
2,6,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,39,,C7,197 EAST 3RD STREET,...,16,1,17,2212,7803,1900,2,C7,-,2016-12-09 00:00:00
3,7,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,,C4,154 EAST 7TH STREET,...,10,0,10,2272,6794,1913,2,C4,3936272,2016-09-23 00:00:00
4,8,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,,C2,301 EAST 10TH STREET,...,6,0,6,2369,4615,1900,2,C2,8000000,2016-11-17 00:00:00

In [5]:
df.drop(df.columns[[0]], axis=1, inplace=True)
df.drop('ease-ment', axis=1, inplace=True)
df.shape

(84548, 20)

In [6]:
df['sale_date']=pd.to_datetime(df.sale_date)

In [7]:
df.head()

,borough,neighborhood,building-class-category,tax_class_at_present,block,lot,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date
0,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,C2,153 AVENUE B,,10009,5,0,5,1633,6440,1900,2,C2,6625000,2017-07-19
1,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,26,C7,234 EAST 4TH STREET,,10009,28,3,31,4616,18690,1900,2,C7,-,2016-12-14
2,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,39,C7,197 EAST 3RD STREET,,10009,16,1,17,2212,7803,1900,2,C7,-,2016-12-09
3,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,C4,154 EAST 7TH STREET,,10009,10,0,10,2272,6794,1913,2,C4,3936272,2016-09-23
4,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,C2,301 EAST 10TH STREET,,10009,6,0,6,2369,4615,1900,2,C2,8000000,2016-11-17

In [8]:
df[u'año']=df['sale_date'].map(lambda x:x.year)
df[u'mes']=df['sale_date'].map(lambda x:x.month)
df[u'dia']=df['sale_date'].map(lambda x:x.day)

In [9]:
df['Q']=df['mes'].map(lambda x:ceil(x/3))
df['S']=df['mes'].map(lambda x:ceil(x/6))

In [10]:
df.head()

,borough,neighborhood,building-class-category,tax_class_at_present,block,lot,building_class_at_present,address,apartment_number,zip_code,...,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,sale_date,año,mes,dia,Q,S
0,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,C2,153 AVENUE B,,10009,...,1900,2,C2,6625000,2017-07-19,2017,7,19,3,2
1,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,26,C7,234 EAST 4TH STREET,,10009,...,1900,2,C7,-,2016-12-14,2016,12,14,4,2
2,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2,399,39,C7,197 EAST 3RD STREET,,10009,...,1900,2,C7,-,2016-12-09,2016,12,9,4,2
3,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2B,402,21,C4,154 EAST 7TH STREET,,10009,...,1913,2,C4,3936272,2016-09-23,2016,9,23,3,2
4,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,404,55,C2,301 EAST 10TH STREET,,10009,...,1900,2,C2,8000000,2016-11-17,2016,11,17,4,2

In [13]:
df.shape

(84548, 25)

In [14]:
lst_dtiempo=['sale_date','año','mes','dia','Q','S']
td_tiempo=df[lst_dtiempo].copy()
td_tiempo.drop_duplicates(inplace=True)
td_tiempo.shape
td_tiempo.sort_values(['sale_date'],ascending=[1],inplace=True)
td_tiempo.reset_index(drop=True,inplace=True)
td_tiempo['id_tiempo']=td_tiempo.index+1
td_tiempo.head()

   sale_date   año  mes  dia  Q  S  id_tiempo
0 2016-09-01  2016    9    1  3  2          1
1 2016-09-02  2016    9    2  3  2          2
2 2016-09-03  2016    9    3  3  2          3
3 2016-09-04  2016    9    4  3  2          4
4 2016-09-05  2016    9    5  3  2          5

In [15]:
df=df.merge(td_tiempo,on=lst_dtiempo,how='inner')
df.drop(lst_dtiempo,axis=1,inplace=True)

In [16]:
df.head()

,borough,neighborhood,building-class-category,tax_class_at_present,block,lot,building_class_at_present,address,apartment_number,zip_code,residential_units,commercial_units,total_units,land_square_feet,gross_square_feet,year_built,tax_class_at_time_of_sale,building_class_at_time_of_sale,sale_price,id_tiempo
0,1,ALPHABET CITY,07 RENTALS - WALKUP APARTMENTS,2A,392,6,C2,153 AVENUE B,,10009,5,0,5,1633,6440,1900,2,C2,6625000,321
1,1,CHELSEA,10 COOPS - ELEVATOR APARTMENTS,2,773,12,D4,"255 WEST 23RD, 4HE",,10011,0,0,0,-,-,1940,2,D4,-,321
2,1,CHELSEA,13 CONDOS - ELEVATOR APARTMENTS,2,695,1810,R4,200 11TH AVENUE,10N,10011,1,0,1,-,-,2007,2,R4,-,321
3,1,CLINTON,13 CONDOS - ELEVATOR APARTMENTS,2,1051,1359,R4,450 WEST 42ND STREET,,10036,1,0,1,-,-,2008,2,R4,1751390,321
4,1,CLINTON,13 CONDOS - ELEVATOR APARTMENTS,2,1063,1282,R4,800 10TH AVENUE,6G,10019,1,0,1,-,-,2008,2,R4,-,321

In [17]:
lst_dciudad=['borough']
td_ciudad=df[lst_dciudad].copy()
td_ciudad.drop_duplicates(inplace=True)
td_ciudad.shape
td_ciudad.sort_values(['borough'],ascending=[1],inplace=True)
td_ciudad.reset_index(drop=True,inplace=True)
td_ciudad['id_ciudad']=td_ciudad.index+1
td_ciudad.head()

   borough  id_ciudad
0        1          1
1        2          2
2        3          3
3        4          4
4        5          5

In [31]:
df=df.merge(td_ciudad,on=lst_dciudad,how='inner')
df.drop(lst_dciudad,axis=1,inplace=True)

In [18]:
lst_dbarrio=['neighborhood']
td_barrio=df[lst_dbarrio].copy()
td_barrio.drop_duplicates(inplace=True)
td_barrio.shape
td_barrio.sort_values(['neighborhood'],ascending=[1],inplace=True)
td_barrio.reset_index(drop=True,inplace=True)
td_barrio['id_barrio']=td_barrio.index+1
td_barrio.head()

         neighborhood  id_barrio
0  AIRPORT LA GUARDIA          1
1       ALPHABET CITY          2
2            ANNADALE          3
3       ARDEN HEIGHTS          4
4            ARROCHAR          5

In [19]:
td_barrio.shape

(254, 2)

In [32]:
df=df.merge(td_barrio,on=lst_dbarrio,how='inner')
df.drop(lst_dbarrio,axis=1,inplace=True)

In [20]:
lst_ddireccion=['address','apartment_number']
td_direccion=df[lst_ddireccion].copy()
td_direccion.drop_duplicates(inplace=True)
td_direccion.shape
td_direccion.sort_values(['address'],ascending=[1],inplace=True)
td_direccion.reset_index(drop=True,inplace=True)
td_direccion['id_direc']=td_direccion.index+1
td_direccion.head()

                 address apartment_number  id_direc
0   ****** 95TH   STREET                          1
1  1 12TH   ST EXTENSION                          2
2             1 5 AVENUE                          3
3      1 5TH AVENUE, 23A                          4
4        1 ASCAN AVE, 35                          5

In [21]:
td_direccion.shape

(79684, 3)

In [33]:
df=df.merge(td_direccion,on=lst_ddireccion,how='inner')
df.drop(lst_ddireccion,axis=1,inplace=True)

In [22]:
lst_dbcc=['building-class-category']
td_bcc=df[lst_dbcc].copy()
td_bcc.drop_duplicates(inplace=True)
td_bcc.shape
td_bcc.sort_values(['building-class-category'],ascending=[1],inplace=True)
td_bcc.reset_index(drop=True,inplace=True)
td_bcc['id_bcc']=td_bcc.index+1
td_bcc.head()

                       building-class-category  id_bcc
0  01 ONE FAMILY DWELLINGS                           1
1  02 TWO FAMILY DWELLINGS                           2
2  03 THREE FAMILY DWELLINGS                         3
3  04 TAX CLASS 1 CONDOS                             4
4  05 TAX CLASS 1 VACANT LAND                        5

In [21]:
td_bcc.shape

(47, 2)

In [34]:
df=df.merge(td_bcc,on=lst_dbcc,how='inner')
df.drop(lst_dbcc,axis=1,inplace=True)

In [23]:
lst_dbcp=['building_class_at_present']
td_bcp=df[lst_dbcp].copy()
td_bcp.drop_duplicates(inplace=True)
td_bcp.shape
td_bcp.sort_values(['building_class_at_present'],ascending=[1],inplace=True)
td_bcp.reset_index(drop=True,inplace=True)
td_bcp['id_bcp']=td_bcp.index+1
td_bcp.head()

  building_class_at_present  id_bcp
0                                 1
1                        A0       2
2                        A1       3
3                        A2       4
4                        A3       5

In [24]:
td_bcp.shape

(167, 2)

In [35]:
df=df.merge(td_bcp,on=lst_dbcp,how='inner')
df.drop(lst_dbcp,axis=1,inplace=True)

In [25]:
lst_dbcs=['building_class_at_time_of_sale']
td_bcs=df[lst_dbcs].copy()
td_bcs.drop_duplicates(inplace=True)
td_bcs.shape
td_bcs.sort_values(['building_class_at_time_of_sale'],ascending=[1],inplace=True)
td_bcs.reset_index(drop=True,inplace=True)
td_bcs['id_bcs']=td_bcs.index+1
td_bcs.head()

  building_class_at_time_of_sale  id_bcs
0                             A0       1
1                             A1       2
2                             A2       3
3                             A3       4
4                             A4       5

In [26]:
td_bcs.shape

(166, 2)

In [36]:
df=df.merge(td_bcs,on=lst_dbcs,how='inner')
df.drop(lst_dbcs,axis=1,inplace=True)

In [27]:
lst_dtaxc=['tax_class_at_present']
td_taxc=df[lst_dtaxc].copy()
td_taxc.drop_duplicates(inplace=True)
td_taxc.sort_values(['tax_class_at_present'],ascending=[1],inplace=True)
td_taxc.reset_index(drop=True,inplace=True)
td_taxc['id_taxc']=td_taxc.index+1
td_taxc.head()

  tax_class_at_present  id_taxc
0                             1
1                    1        2
2                   1A        3
3                   1B        4
4                   1C        5

In [28]:
td_taxc.shape

(11, 2)

In [37]:
df=df.merge(td_taxc,on=lst_dtaxc,how='inner')
df.drop(lst_dtaxc,axis=1,inplace=True)

In [29]:
lst_dtaxs=['tax_class_at_time_of_sale']
td_taxs=df[lst_dtaxs].copy()
td_taxs.drop_duplicates(inplace=True)
td_taxs.shape
td_taxs.sort_values(['tax_class_at_time_of_sale'],ascending=[1],inplace=True)
td_taxs.reset_index(drop=True,inplace=True)
td_taxs['id_taxs']=td_taxs.index+1
td_taxs.head()

   tax_class_at_time_of_sale  id_taxs
0                          1        1
1                          2        2
2                          3        3
3                          4        4

In [38]:
df=df.merge(td_taxs,on=lst_dtaxs,how='inner')
df.drop(lst_dtaxs,axis=1,inplace=True)

In [30]:
lst_dblot=['block','lot']
td_blot=df[lst_dblot].copy()
td_blot.drop_duplicates(inplace=True)
td_blot.shape
td_blot.sort_values(['block','lot'],ascending=[1,1],inplace=True)
td_blot.reset_index(drop=True,inplace=True)
td_blot['id_blot']=td_blot.index+1
td_blot.head()

   block   lot  id_blot
0      1   216        1
1      1  1002        2
2      1  1020        3
3      1  1029        4
4      1  1030        5

In [40]:
df=df.merge(td_blot,on=lst_dblot,how='inner')
df.drop(lst_dblot,axis=1,inplace=True)

KeyError: 'block'

In [42]:
lst_dtam=['land_square_feet','gross_square_feet']
td_tam=df[lst_dtam].copy()
td_tam.drop_duplicates(inplace=True)
td_tam.shape
td_tam.sort_values(['land_square_feet','gross_square_feet'],ascending=[1,1],inplace=True)
td_tam.reset_index(drop=True,inplace=True)
td_tam['id_tam']=td_tam.index+1
td_tam.head()

  land_square_feet gross_square_feet  id_tam
0              -                 -         1
1              -               28801       2
2              -               32843       3
3              -               33770       4
4              -               36472       5

In [43]:
df=df.merge(td_tam,on=lst_dtam,how='inner')
df.drop(lst_dtam,axis=1,inplace=True)

In [45]:
lst_dunit=['residential_units','commercial_units']
td_unit=df[lst_dunit].copy()
td_unit.drop_duplicates(inplace=True)
td_unit.shape
td_unit.sort_values(['residential_units','commercial_units'],ascending=[1,1],inplace=True)
td_unit.reset_index(drop=True,inplace=True)
td_unit['id_unit']=td_unit.index+1
td_unit.head()

   residential_units  commercial_units  id_unit
0                  0                 0        1
1                  0                 1        2
2                  0                 2        3
3                  0                 3        4
4                  0                 4        5

In [47]:
df=df.merge(td_unit,on=lst_dunit,how='inner')
df.drop(lst_dunit,axis=1,inplace=True)

In [48]:
df.head()

,zip_code,total_units,year_built,sale_price,id_tiempo,id_ciudad,id_barrio,id_direc,id_bcc,id_bcp,id_bcs,id_taxc,id_taxs,id_blot,id_tam,id_unit_x,id_unit_y
0,10009,5,1900,6625000,321,1,2,17655,7,17,16,7,2,4387,3516,85,85
1,10019,5,1920,7000000,320,1,45,55912,7,17,16,7,2,12062,9936,85,85
2,10011,5,1900,10250000,300,1,106,60247,7,17,16,7,2,5896,2883,85,85
3,10014,5,1910,-,239,1,107,69916,7,17,16,7,2,6587,9826,85,85
4,10014,5,1900,313000,264,1,107,49625,7,17,16,7,2,6121,10750,85,85